; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	image4 - mode
	thermograph3 - mode
	thermograph0 - mode
	image1 - mode
	thermograph2 - mode
	GroundStation3 - direction
	Star5 - direction
	GroundStation2 - direction
	Star6 - direction
	GroundStation1 - direction
	Star4 - direction
	Star0 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph2)
	(supports instrument0 image4)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument1 thermograph3)
	(supports instrument1 image4)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star6)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument2 image1)
	(supports instrument2 image4)
	(calibration_target instrument2 Star4)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star13)
	(supports instrument3 thermograph3)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star13)
)
(:goal (and
	(have_image Star7 thermograph0)
	(have_image Star8 thermograph2)
	(have_image Star9 thermograph3)
	(have_image Planet10 image4)
	(have_image Planet11 image4)
	(have_image Planet12 thermograph3)
	(have_image Star13 image4)
))

)

; plan
1. (turn_to satellite3 star0 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 star0)
   goals met: 0 of 7
2. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite3 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite3 star7 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 star7)
   goals met: 0 of 7
5. (take_image satellite3 star7 instrument3 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 1 of 7
6. (turn_to satellite3 planet12 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 planet12)
   goals met: 1 of 7
7. (take_image satellite3 planet12 instrument3 thermograph3)
   added: (have_image planet12 thermograph3)
   goals met: 2 of 7
8. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 7
9. (calibrate satellite1 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 2 of 7
10. (turn_to satellite1 planet10 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet10)
   goals met: 2 of 7
11. (take_image satellite1 planet10 instrument1 image4)
   added: (have_image planet10 image4)
   goals met: 3 of 7
12. (turn_to satellite1 planet11 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet11)
   goals met: 3 of 7
13. (take_image satellite1 planet11 instrument1 image4)
   added: (have_image planet11 image4)
   goals met: 4 of 7
14. (turn_to satellite1 star13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star13)
   goals met: 4 of 7
15. (take_image satellite1 star13 instrument1 image4)
   added: (have_image star13 image4)
   goals met: 5 of 7
16. (turn_to satellite1 star8 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star8)
   goals met: 5 of 7
17. (take_image satellite1 star8 instrument1 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 6 of 7
18. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 6 of 7
19. (take_image satellite1 star9 instrument1 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 7 of 7
